In [2]:
import pandas as pd

## 讀取資料

In [3]:
"""
    age: 年紀
    gender: 性別
    occupation: 職業
    zip_code: 郵政編碼
"""   
就業資料_df = pd.read_excel("就業資料.xlsx",index_col='user_id')
display(就業資料_df.info()) # 整份df 類型 描述出來
display(就業資料_df.describe()) #整份df 有關數值 基本參數都會算出來
就業資料_df

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

None

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

## 計算每一個職業的平均年齡

In [4]:
就業資料_df.groupby('occupation').age.sum()

occupation
administrator    3061
artist            879
doctor            305
educator         3991
engineer         2438
entertainment     526
executive        1239
healthcare        665
homemaker         228
lawyer            441
librarian        2040
marketing         978
none              239
other            3625
programmer       2186
retired           883
salesman          428
scientist        1102
student          4328
technician        895
writer           1634
Name: age, dtype: int64

## 分析哪一個職業的男性比率最高

In [5]:
# 計算出每一個職業中男生所佔的比例，並且降冪排序(公式：每一個職業男性數量的總和 ÷ 每一個職業的總數)
def 轉換性別(x):
    if x== 'M':
        return 1
    if x == 'F':
        return 0
就業資料_df['gender_number'] = 就業資料_df['gender'].apply(轉換性別) #取代for loop
就業資料_df

         age gender     occupation zip_code  gender_number
user_id
1         24      M     technician    85711              1
2         53      F          other    94043              0
3         23      M         writer    32067              1
4         24      M     technician    43537              1
5         33      F          other    15213              0
...      ...    ...            ...      ...            ...
939       26      F        student    33319              0
940       32      M  administrator    02215              1
941       20      M        student    97229              1
942       48      F      librarian    78209              0
943       22      M        student    77841              1

[943 rows x 5 columns]

## 計算出每一個職業中男生所佔的比例，並且降冪排序

In [11]:
# 公式：每一個職業男性數量的總和 ÷ 每一個職業的總數
result = (就業資料_df.groupby('occupation').gender_number.sum()) / 就業資料_df.occupation.value_counts() * 100
result.sort_values(ascending=False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64